modules/integration/tests-integration/tests-patches/src/test/resources/artifacts/ESB/mediatorconfig/callout/CallMediatorBlockProxyForSalesforce.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ~ Copyright (c) 2016, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
  ~
  ~ WSO2 Inc. licenses this file to you under the Apache License,
  ~ Version 2.0 (the "License"); you may not use this file except
  ~ in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~ http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->

<definitions xmlns="http://ws.apache.org/ns/synapse">
    <proxy name="CallMediatorBlockProxyForSalesforce" startOnLoad="true"
           trace="disable" transports="https http">
        <description/>
        <target>
            <inSequence>
                <payloadFactory media-type="xml">
                    <format>
                        <soapenv:Envelope
                                xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                                xmlns:urn="urn:partner.soap.sforce.com">
                            <soapenv:Body>
                                <urn:login>
                                    <urn:username>thusithathilina@gmail.com</urn:username>
                                    <urn:password>abcd1234aDHMGODGQvJ7WuSp4iVL3cTTy</urn:password>
                                </urn:login>
                            </soapenv:Body>
                        </soapenv:Envelope>
                    </format>
                    <args/>
                </payloadFactory>
                <!--callout serviceURL="https://login.salesforce.com/services/Soap/u/36.0"
                     action="urn:login">
               <source xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
                       xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"
                       xpath="s11:Body/child::*[fn:position()=1] | s12:Body/child::*[fn:position()=1]"/>
               <target xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
                       xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"
                       xpath="s11:Body/child::*[fn:position()=1] | s12:Body/child::*[fn:position()=1]"/>
            </callout>-->
                <call blocking="true">
                    <endpoint>
                        <address uri="https://login.salesforce.com/services/Soap/u/36.0"/>
                    </endpoint>
                </call>
                <respond/>
            </inSequence>
        </target>
    </proxy>

</definitions>